sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.h
/*!
    \file    gd32a7xx_linflexd_uart.h
    \brief   definitions for the LINFLEXD_UART

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_LINFLEXD_UART_H
#define GD32A7XX_LINFLEXD_UART_H

#include "gd32a7xx.h"

/* peripheral address definitions */
#define LINFLEXD_UART0                (LINFLEXD_BASE + 0x00008000U)               /*!< LINFLEXD_UART0 base address */
#define LINFLEXD_UART1                (LINFLEXD_BASE + 0x00008400U)               /*!< LINFLEXD_UART1 base address */
#define LINFLEXD_UART2                (LINFLEXD_BASE + 0x00008800U)               /*!< LINFLEXD_UART2 base address */
#define LINFLEXD_UART3                (LINFLEXD_BASE + 0x00008C00U)               /*!< LINFLEXD_UART3 base address */
#define LINFLEXD_UART4                (LINFLEXD_BASE + 0x00009000U)               /*!< LINFLEXD_UART4 base address */
#define LINFLEXD_UART5                (LINFLEXD_BASE + 0x00009400U)               /*!< LINFLEXD_UART5 base address */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define LINFLEXD_UART6                LINFLEXD_BASE                               /*!< LINFLEXD_UART6 base address (Only for GD32A714Axx /A72xAxx / A74xAxx devices) */
#define LINFLEXD_UART7                (LINFLEXD_BASE + 0x00000400U)               /*!< LINFLEXD_UART7 base address (Only for GD32A714Axx /A72xAxx / A74xAxx devices) */
#define LINFLEXD_UART8                (LINFLEXD_BASE + 0x00000800U)               /*!< LINFLEXD_UART8 base address (Only for GD32A714Axx /A72xAxx / A74xAxx devices) */
#define LINFLEXD_UART9                (LINFLEXD_BASE + 0x00000C00U)               /*!< LINFLEXD_UART9 base address (Only for GD32A714Axx /A72xAxx / A74xAxx devices) */
#define LINFLEXD_UART10               (LINFLEXD_BASE + 0x00001000U)               /*!< LINFLEXD_UART10 base address (Only for GD32A714Axx /A72xAxx / A74xAxx devices) */
#define LINFLEXD_UART11               (LINFLEXD_BASE + 0x00001400U)               /*!< LINFLEXD_UART11 base address (Only for GD32A714Axx /A72xAxx / A74xAxx devices) */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* registers definitions (all) */
#define LINFLEXD_UART_LINCR1(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x00000000U)              /*!< LINFLEXD_UART control register 1 */
#define LINFLEXD_UART_LINIER(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x00000004U)              /*!< LINFLEXD_UART interrupt enable register */
#define LINFLEXD_UART_LINSR(linflexdx_uartx)         REG32((linflexdx_uartx) + 0x00000008U)              /*!< LINFLEXD_UART status register */
#define LINFLEXD_UART_LINESR(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x0000000CU)              /*!< LINFLEXD_UART error status register */
#define LINFLEXD_UART_UARTCR(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x00000010U)              /*!< LINFLEXD_UART mode control register */
#define LINFLEXD_UART_UARTSR(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x00000014U)              /*!< LINFLEXD_UART mode status register */
#define LINFLEXD_UART_LINTCSR(linflexdx_uartx)       REG32((linflexdx_uartx) + 0x00000018U)              /*!< LINFLEXD_UART timeout control status register */
#define LINFLEXD_UART_LINOCR(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x0000001CU)              /*!< LINFLEXD_UART output compare register */
#define LINFLEXD_UART_LINTOCR(linflexdx_uartx)       REG32((linflexdx_uartx) + 0x00000020U)              /*!< LINFLEXD_UART timeout control register */
#define LINFLEXD_UART_LINFBRR(linflexdx_uartx)       REG32((linflexdx_uartx) + 0x00000024U)              /*!< LINFLEXD_UART fractional baud rate register */
#define LINFLEXD_UART_LINIBRR(linflexdx_uartx)       REG32((linflexdx_uartx) + 0x00000028U)              /*!< LINFLEXD_UART integer baud rate register */
#define LINFLEXD_UART_LINCFR(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x0000002CU)              /*!< LINFLEXD_UART checksum field register */
#define LINFLEXD_UART_LINCR2(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x00000030U)              /*!< LINFLEXD_UART control register 2 */
#define LINFLEXD_UART_BIDR(linflexdx_uartx)          REG32((linflexdx_uartx) + 0x00000034U)              /*!< LINFLEXD_UART buffer identifier register */
#define LINFLEXD_UART_BDRL(linflexdx_uartx)          REG32((linflexdx_uartx) + 0x00000038U)              /*!< LINFLEXD_UART buffer data register least significant */
#define LINFLEXD_UART_BDRM(linflexdx_uartx)          REG32((linflexdx_uartx) + 0x0000003CU)              /*!< LINFLEXD_UART buffer data register most significant */
#define LINFLEXD_UART_IFER(linflexdx_uartx)          REG32((linflexdx_uartx) + 0x00000040U)              /*!< LINFLEXD_UART identifier filter enable register */
#define LINFLEXD_UART_IFMI(linflexdx_uartx)          REG32((linflexdx_uartx) + 0x00000044U)              /*!< LINFLEXD_UART identifier filter match index */
#define LINFLEXD_UART_IFMR(linflexdx_uartx)          REG32((linflexdx_uartx) + 0x00000048U)              /*!< LINFLEXD_UART identifier filter mode register */
#define LINFLEXD_UART_IFCR(linflexdx_uartx, n)       REG32((linflexdx_uartx) + 0x0000004CU + (n) * 0x4U) /*!< LINFLEXD_UART identifier filter control register */
#define LINFLEXD_UART_GCR(linflexdx_uartx)           REG32((linflexdx_uartx) + 0x0000008CU)              /*!< LINFLEXD_UART global control register */
#define LINFLEXD_UART_UARTPTO(linflexdx_uartx)       REG32((linflexdx_uartx) + 0x00000090U)              /*!< LINFLEXD_UART UART preset timeout register */
#define LINFLEXD_UART_UARTCTO(linflexdx_uartx)       REG32((linflexdx_uartx) + 0x00000094U)              /*!< LINFLEXD_UART UART current timeout register */
#define LINFLEXD_UART_DMATXE(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x00000098U)              /*!< LINFLEXD_UART DMA Tx enable register */
#define LINFLEXD_UART_DMARXE(linflexdx_uartx)        REG32((linflexdx_uartx) + 0x0000009CU)              /*!< LINFLEXD_UART DMA Rx enable register */
#define LINFLEXD_UART_LIN_STCTL(linflexdx_uartx)     REG32((linflexdx_uartx) + 0x000000A0U)              /*!< LINFLEXD_UART stop control register */

/* bits definitions (only for LINFlexD_UART) */
/* LINCR1 */
#define LINFLEXD_UART_LINCR1_INIT             BIT(0)                               /*!< initialization mode request */
#define LINFLEXD_UART_LINCR1_SLEEP            BIT(1)                               /*!< sleep mode request */
#define LINFLEXD_UART_LINCR1_RBLM             BIT(2)                               /*!< receiver buffer locked mode */
#define LINFLEXD_UART_LINCR1_LBKM             BIT(5)                               /*!< loop back mode */
#define LINFLEXD_UART_LINCR1_AUTOWU           BIT(12)                              /*!< automatic wake-up */

/* LINIER */
#define LINFLEXD_UART_LINIER_HRIE             BIT(0)                               /*!< header received interrupt enable */
#define LINFLEXD_UART_LINIER_DTIE             BIT(1)                               /*!< data transmitted interrupt enable */
#define LINFLEXD_UART_LINIER_DRIE             BIT(2)                               /*!< data reception complete interrupt enable */
#define LINFLEXD_UART_LINIER_TOIE             BIT(3)                               /*!< timeout interrupt enable */
#define LINFLEXD_UART_LINIER_WUIE             BIT(5)                               /*!< wakeup interrupt enable */
#define LINFLEXD_UART_LINIER_LSIE             BIT(6)                               /*!< LIN state interrupt enable */
#define LINFLEXD_UART_LINIER_BOIE             BIT(7)                               /*!< buffer overrun interrupt enable */
#define LINFLEXD_UART_LINIER_FEIE             BIT(8)                               /*!< frame error interrupt enable */
#define LINFLEXD_UART_LINIER_HEIE             BIT(11)                              /*!< header error interrupt enable */
#define LINFLEXD_UART_LINIER_CEIE             BIT(12)                              /*!< checksum error interrupt enable */
#define LINFLEXD_UART_LINIER_BEIE             BIT(13)                              /*!< bit error interrupt enable */
#define LINFLEXD_UART_LINIER_OCIE             BIT(14)                              /*!< output compare interrupt enable */
#define LINFLEXD_UART_LINIER_SZIE             BIT(15)                              /*!< stuck at zero interrupt enable */

