sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.h
/* LINSR */
#define LINFLEXD_UART_LINSR_HRF               BIT(0)                               /*!< header received flag */
#define LINFLEXD_UART_LINSR_DTF               BIT(1)                               /*!< data transmission completed flag */
#define LINFLEXD_UART_LINSR_DRF               BIT(2)                               /*!< data reception completed flag */
#define LINFLEXD_UART_LINSR_WUF               BIT(5)                               /*!< wakeup flag */
#define LINFLEXD_UART_LINSR_RDI               BIT(6)                               /*!< receiver data input */
#define LINFLEXD_UART_LINSR_RXBUSY            BIT(7)                               /*!< receiver busy flag */
#define LINFLEXD_UART_LINSR_DRBNE             BIT(8)                               /*!< data reception buffer not empty flag */
#define LINFLEXD_UART_LINSR_RMB               BIT(9)                               /*!< release message buffer */
#define LINFLEXD_UART_LINSR_LINS              BITS(12, 15)                         /*!< LIN state */
#define LINFLEXD_UART_LINSR_RDC               BITS(16, 18)                         /*!< receive data byte count */
#define LINFLEXD_UART_LINSR_AUTOSYNC_COMP     BIT(19)                              /*!< autosynchronization complete */

/* UARTCR */
#define LINFLEXD_UART_UARTCR_UART             BIT(0)                               /*!< UART mode */
#define LINFLEXD_UART_UARTCR_WL0              BIT(1)                               /*!< word length in UART mode */
#define LINFLEXD_UART_UARTCR_PCE              BIT(2)                               /*!< parity control enable */
#define LINFLEXD_UART_UARTCR_PC0              BIT(3)                               /*!< parity control 0 */
#define LINFLEXD_UART_UARTCR_TXEN             BIT(4)                               /*!< transmitter enable */
#define LINFLEXD_UART_UARTCR_RXEN             BIT(5)                               /*!< receiver enable */
#define LINFLEXD_UART_UARTCR_PC1              BIT(6)                               /*!< parity control 1 */
#define LINFLEXD_UART_UARTCR_WL1              BIT(7)                               /*!< word length in UART mode 1 */
#define LINFLEXD_UART_UARTCR_TFBM             BIT(8)                               /*!< tx FIFO/buffer mode */
#define LINFLEXD_UART_UARTCR_RFBM             BIT(9)                               /*!< rx FIFO/buffer mode */
#define LINFLEXD_UART_UARTCR_RDFL_RFC         BITS(10, 12)                         /*!< receiver data field length/rx FIFO counter */
#define LINFLEXD_UART_UARTCR_TDFL_TFC         BITS(13, 15)                         /*!< transmitter data field length/tx FIFO counter */
#define LINFLEXD_UART_UARTCR_WLS              BIT(16)                              /*!< special word length in UART mode */
#define LINFLEXD_UART_UARTCR_SBUR             BITS(17, 18)                         /*!< number of stop bits in UART reception mode */
#define LINFLEXD_UART_UARTCR_DTU              BIT(19)                              /*!< disable timeout in UART mode */
#define LINFLEXD_UART_UARTCR_NEF              BITS(20, 22)                         /*!< number of expected frames */
#define LINFLEXD_UART_UARTCR_ROSE             BIT(23)                              /*!< reduced oversampling enable */
#define LINFLEXD_UART_UARTCR_OSR              BITS(24, 27)                         /*!< oversampling rate */
#define LINFLEXD_UART_UARTCR_CSP              BITS(28, 30)                         /*!< configurable sample point */
#define LINFLEXD_UART_UARTCR_MIS              BIT(31)                              /*!< monitor idle state */

/* UARTSR */
#define LINFLEXD_UART_UARTSR_NF               BIT(0)                               /*!< noise flag */
#define LINFLEXD_UART_UARTSR_DTF_TFF          BIT(1)                               /*!< data transmission completed flag/ tx FIFO full flag */
#define LINFLEXD_UART_UARTSR_DRF_RFE          BIT(2)                               /*!< data reception completed flag / rx FIFO empty flag */
#define LINFLEXD_UART_UARTSR_TO               BIT(3)                               /*!< timeout */
#define LINFLEXD_UART_UARTSR_RFNE             BIT(4)                               /*!< receive FIFO not empty */
#define LINFLEXD_UART_UARTSR_WUF              BIT(5)                               /*!< wakeup flag */
#define LINFLEXD_UART_UARTSR_RDI              BIT(6)                               /*!< receiver data input */
#define LINFLEXD_UART_UARTSR_BOF              BIT(7)                               /*!< FIFO / buffer overrun flag */
#define LINFLEXD_UART_UARTSR_FEF              BIT(8)                               /*!< framing error flag */
#define LINFLEXD_UART_UARTSR_RMB              BIT(9)                               /*!< release message buffer */
#define LINFLEXD_UART_UARTSR_PE               BITS(10, 13)                         /*!< parity error flag */
#define LINFLEXD_UART_UARTSR_OCF              BIT(14)                              /*!< output compare flag */
#define LINFLEXD_UART_UARTSR_SZF              BIT(15)                              /*!< stuck at zero flag */

/* LINFBRR */
#define LINFLEXD_UART_LINFBRR_FBR             BITS(0, 3)                           /*!< fractional baud rate */

/* LINIBRR */
#define LINFLEXD_UART_LINIBRR_IBR             BITS(0, 19)                          /*!< integer baud rate */

/* LINCR2 */
#define LINFLEXD_UART_LINCR2_ABRQ             BIT(9)                               /*!< abort request */

/* BDRL */
#define LINFLEXD_UART_BDRL_DATA0              BITS(0, 7)                           /*!< data byte 0 */
#define LINFLEXD_UART_BDRL_DATA1              BITS(8, 15)                          /*!< data byte 1 */
#define LINFLEXD_UART_BDRL_DATA2              BITS(16, 23)                         /*!< data byte 2 */
#define LINFLEXD_UART_BDRL_DATA3              BITS(24, 31)                         /*!< data byte 3 */

/* BDRM */
#define LINFLEXD_UART_BDRM_DATA4              BITS(0, 7)                           /*!< data byte 4 */
#define LINFLEXD_UART_BDRM_DATA5              BITS(8, 15)                          /*!< data byte 5 */
#define LINFLEXD_UART_BDRM_DATA6              BITS(16, 23)                         /*!< data byte 6 */
#define LINFLEXD_UART_BDRM_DATA7              BITS(24, 31)                         /*!< data byte 7 */

/* GCR */
#define LINFLEXD_UART_GCR_SR                  BIT(0)                               /*!< soft reset */
#define LINFLEXD_UART_GCR_STOP                BIT(1)                               /*!< one or two stop bit configuration */
#define LINFLEXD_UART_GCR_RDLIS               BIT(2)                               /*!< receive data level inversion selection */
#define LINFLEXD_UART_GCR_TDLIS               BIT(3)                               /*!< transmit data level inversion selection */
#define LINFLEXD_UART_GCR_RDFBM               BIT(4)                               /*!< receive data first bit MSB */
#define LINFLEXD_UART_GCR_TDFBM               BIT(5)                               /*!< transmit data first bit MSB */

/* UARTPTO */
#define LINFLEXD_UART_UARTPTO_PTO             BITS(0, 11)                          /*!< preset timeout */

