sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.h
/* UARTCTO */
#define LINFLEXD_UART_UARTCTO_CTO             BITS(0, 11)                          /*!< current timeout value */

/* DMATXE */
#define LINFLEXD_UART_DMATXE_DTE0             BIT(0)                               /*!< DMA Tx channel 0 enable */

/* DMARXE */
#define LINFLEXD_UART_DMARXE_DRE0             BIT(0)                               /*!< DMA Rx channel 0 enable */

/* LIN_STCTL */
#define LINFLEXD_UART_LIN_STCTL_STOP          BIT(0)                               /*!< terminate the transmission */
#define LINFLEXD_UART_LIN_STCTL_ACK           BIT(1)                               /*!< the stop function takes effect */
#define LINFLEXD_UART_LIN_STCTL_SIZE          BITS(2, 3)                           /*!< the byte size transmitted on the IPS bus */
#define LINFLEXD_UART_LIN_STCTL_TX_INV        BIT(4)                               /*!< TX pin level inversion */
#define LINFLEXD_UART_LIN_STCTL_RX_INV        BIT(5)                               /*!< RX pin level inversion */

/* constants definitions */
/* define the LINFlexD_UART bit position and its register index offset */
#define LINFLEXD_UART_REGIDX_BIT(regidx, bitpos)    (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define LINFLEXD_UART_REG_VAL(linflexd_uartx, offset)       (REG32((linflexd_uartx) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define LINFLEXD_UART_BIT_POS(val)                  ((uint32_t)(val) & 0x0000001FU)
#define LINFLEXD_UART_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define LINFLEXD_UART_REG_VAL2(linflexd_uartx, offset)       (REG32((linflexd_uartx) + ((uint32_t)(offset) >> 22)))
#define LINFLEXD_UART_BIT_POS2(val)                  (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define LINFLEXD_UART_LINIER_REG_OFFSET             0x00000004U                 /*!< LINIER register offset */
#define LINFLEXD_UART_UARTSR_REG_OFFSET             0x00000014U                 /*!< UARTSR register offset */

/* LINFlexD_UART flags */
typedef enum {
    /* flags in UARTSR */
    LINFLEXD_UART_FLAG_NF              = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 0U),     /*!< noise flag */
    LINFLEXD_UART_FLAG_DTF_TFF         = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 1U),     /*!< data transmission completed flag/ Tx FIFO full flag */
    LINFLEXD_UART_FLAG_DRF_RFE         = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 2U),     /*!< data reception completed flag / Rx FIFO empty flag */
    LINFLEXD_UART_FLAG_TO              = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 3U),     /*!< timeout flag */
    LINFLEXD_UART_FLAG_RFNE            = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 4U),     /*!< receive FIFO not empty flag */
    LINFLEXD_UART_FLAG_WUF             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 5U),     /*!< wakeup flag */
    LINFLEXD_UART_FLAG_RDI             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 6U),     /*!< receiver input state flag */
    LINFLEXD_UART_FLAG_BOF             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 7U),     /*!< FIFO / buffer overrun flag */
    LINFLEXD_UART_FLAG_FEF             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 8U),     /*!< frame error flag */
    LINFLEXD_UART_FLAG_RMB             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 9U),     /*!< release message buffer flag */
    LINFLEXD_UART_FLAG_PE0             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 10U),    /*!< parity error 0 flag */
    LINFLEXD_UART_FLAG_PE1             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 11U),    /*!< parity error 1 flag */
    LINFLEXD_UART_FLAG_PE2             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 12U),    /*!< parity error 2 flag */
    LINFLEXD_UART_FLAG_PE3             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 13U),    /*!< parity error 3 flag */
    LINFLEXD_UART_FLAG_OCF             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 14U),    /*!< output compare flag */
    LINFLEXD_UART_FLAG_SZF             = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_UARTSR_REG_OFFSET, 15U),    /*!< stuck at zero flag */
} linflexd_uart_flag_enum;

/* LINFlexD_UART interrupts */
typedef enum {
    /* interrupts in LINIER */
    LINFLEXD_UART_INT_DTF              = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_LINIER_REG_OFFSET, 1U),     /*!< data transmitted interrupt */
    LINFLEXD_UART_INT_DRF              = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_LINIER_REG_OFFSET, 2U),     /*!< data reception complete interrupt */
    LINFLEXD_UART_INT_TO               = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_LINIER_REG_OFFSET, 3U),     /*!< timeout interrupt */
    LINFLEXD_UART_INT_WUF              = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_LINIER_REG_OFFSET, 5U),     /*!< wakeup interrupt */
    LINFLEXD_UART_INT_BOF              = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_LINIER_REG_OFFSET, 7U),     /*!< buffer overrun interrupt */
    LINFLEXD_UART_INT_FEF              = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_LINIER_REG_OFFSET, 8U),     /*!< frame error interrupt */
    LINFLEXD_UART_INT_OCF              = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_LINIER_REG_OFFSET, 14U),    /*!< output compare interrupt */
    LINFLEXD_UART_INT_SZF              = LINFLEXD_UART_REGIDX_BIT(LINFLEXD_UART_LINIER_REG_OFFSET, 15U),    /*!< stuck at zero interrupt */
} linflexd_uart_interrupt_enum;

/* LINFlexD_UART interrupt flags */
typedef enum {
    /* interrupt flags in UARTSR and LINIER */
    LINFLEXD_UART_INT_FLAG_DTF         = LINFLEXD_UART_REGIDX_BIT2(LINFLEXD_UART_LINIER_REG_OFFSET, 1U, LINFLEXD_UART_UARTSR_REG_OFFSET, 1U),     /*!< data transmission completed interrupt and flag */
    LINFLEXD_UART_INT_FLAG_DRF         = LINFLEXD_UART_REGIDX_BIT2(LINFLEXD_UART_LINIER_REG_OFFSET, 2U, LINFLEXD_UART_UARTSR_REG_OFFSET, 2U),     /*!< data reception completed interrupt and flag */
    LINFLEXD_UART_INT_FLAG_TO          = LINFLEXD_UART_REGIDX_BIT2(LINFLEXD_UART_LINIER_REG_OFFSET, 3U, LINFLEXD_UART_UARTSR_REG_OFFSET, 3U),     /*!< timeout interrupt and flag */
    LINFLEXD_UART_INT_FLAG_WUF         = LINFLEXD_UART_REGIDX_BIT2(LINFLEXD_UART_LINIER_REG_OFFSET, 5U, LINFLEXD_UART_UARTSR_REG_OFFSET, 5U),     /*!< wakeup interrupt and flag */
    LINFLEXD_UART_INT_FLAG_BOF         = LINFLEXD_UART_REGIDX_BIT2(LINFLEXD_UART_LINIER_REG_OFFSET, 7U, LINFLEXD_UART_UARTSR_REG_OFFSET, 7U),     /*!< buffer overrun interrupt and flag */
    LINFLEXD_UART_INT_FLAG_FEF         = LINFLEXD_UART_REGIDX_BIT2(LINFLEXD_UART_LINIER_REG_OFFSET, 8U, LINFLEXD_UART_UARTSR_REG_OFFSET, 8U),     /*!< framing error interrupt and flag */
    LINFLEXD_UART_INT_FLAG_OCF         = LINFLEXD_UART_REGIDX_BIT2(LINFLEXD_UART_LINIER_REG_OFFSET, 14U, LINFLEXD_UART_UARTSR_REG_OFFSET, 14U),   /*!< output compare interrupt and flag */
    LINFLEXD_UART_INT_FLAG_SZF         = LINFLEXD_UART_REGIDX_BIT2(LINFLEXD_UART_LINIER_REG_OFFSET, 15U, LINFLEXD_UART_UARTSR_REG_OFFSET, 15U),   /*!< stuck at zero interrupt and flag */
} linflexd_uart_interrupt_flag_enum;

/* LINFlexD_UART parity type */
typedef enum
{
    LINFLEXD_UART_PARITY_EVEN = 0U,         /*!< LINFLEXD_UART parity with even type */
    LINFLEXD_UART_PARITY_ODD = 1U,          /*!< LINFLEXD_UART parity with odd type */
    LINFLEXD_UART_PARITY_ALWAYS_0 = 2U,     /*!< LINFLEXD_UART parity always 0 */
    LINFLEXD_UART_PARITY_ALWAYS_1 = 3U      /*!< LINFLEXD_UART parity always 1 */
} linflexd_uart_parity_type_enum;

