sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.h
/* LINFlexD_UART stop bits count */
typedef enum
{
    LINFLEXD_UART_ONE_STOP_BIT = 0U,        /*!< LINFLEXD_UART 1 stop bit */
    LINFLEXD_UART_TWO_STOP_BITS = 1U,       /*!< LINFLEXD_UART 2 stop bits */
    LINFLEXD_UART_THREE_STOP_BITS = 2U      /*!< LINFLEXD_UART 3 stop bits (only for receiver) */
} linflexd_uart_stop_bits_count_enum;

/* LINFlexD_UART word length */
typedef enum
{
    LINFLEXD_UART_7_BITS = 0U,              /*!< LINFLEXD_UART word length of 7-bit */
    LINFLEXD_UART_8_BITS = 1U,              /*!< LINFLEXD_UART word length of 8-bit */
    LINFLEXD_UART_15_BITS = 2U,             /*!< LINFLEXD_UART word length of 15-bit */
    LINFLEXD_UART_16_BITS = 3U              /*!< LINFLEXD_UART word length of 16-bit */
} linflexd_uart_word_length_enum;

/* LINFlexD_UART rx and tx mode */
typedef enum
{
    LINFLEXD_UART_TXRX_BUFFER_MODE = 0U,    /*!< LINFLEXD_UART TX/RX buffer mode */
    LINFLEXD_UART_TXRX_FIFO_MODE = 1U       /*!< LINFLEXD_UART TX/RX FIFO mode */
} linflexd_uart_txrx_mode_enum;

/* LINFlexD_UART state */
typedef enum
{
    LINFLEXD_UART_STATE_SLEEP_MODE = 0U,        /*!< sleep mode, low power state */
    LINFLEXD_UART_STATE_INIT_MODE = 1U,         /*!< initialization mode, registers can be configured */
    LINFLEXD_UART_STATE_IDLE_MODE = 2U,         /*!< idle mode, ready to transmit or receive data */
    LINFLEXD_UART_STATE_SYNC_BREAK = 3U,        /*!< synchronization break state, start of a LIN frame (only for LIN) */
    LINFLEXD_UART_STATE_SYNC_DEL = 4U,          /*!< synchronization delimiter state, part of LIN header (only for LIN) */
    LINFLEXD_UART_STATE_SYNC_FIELD = 5U,        /*!< synchronization field state, used for bit rate sync (only for LIN) */
    LINFLEXD_UART_STATE_IDENTIFIER_FIELD = 6U,  /*!< identifier field state, processing LIN frame ID (only for LIN) */
    LINFLEXD_UART_STATE_HEADER_RX_TX = 7U,      /*!< header reception/transmission state (only for LIN) */
    LINFLEXD_UART_STATE_DATA_RX_TX = 8U,        /*!< data reception/transmission state */
    LINFLEXD_UART_STATE_CHECKSUM = 9U           /*!< checksum state, processing LIN frame verification (only for LIN) */
} linflexd_uart_state_enum;

/* LINFlexD_UART mode */
typedef enum
{
    LINFLEXD_LIN_MODE = 0U,                 /*!< LIN mode */
    LINFLEXD_UART_MODE = 1U                 /*!< UART mode */
} linflexd_uart_mode_enum;

/* LINFlexD_UART timeout counter reset mode */
typedef enum
{
    LINFLEXD_UART_TIMEOUT_SW_HANDLE = 0U,              /*!< timeout must be handled by software */
    LINFLEXD_UART_TIMEOUT_DISABLE_AFTER_FRAMES = 1U    /*!< timeout is disabled after receiving the configured number of data frames */
} linflexd_uart_timeout_control_enum;

/* LINFlexD_UART data first bit MSB */
typedef enum {
    LINFLEXD_UART_DATAFIRST_LSB = 0U,            /*!< LSB first */
    LINFLEXD_UART_DATAFIRST_MSB = 1U             /*!< MSB first */
} linflexd_uart_datafirst_enum;

/* LINFlexD_UART TX and RX invert configure */
typedef enum {
    LINFLEXD_UART_TXRX_INVERT_DISABLE = 0U,       /*!< TX/RX data/pin level not inversion */
    LINFLEXD_UART_TXRX_INVERT_ENABLE = 1U         /*!< TX/RX data/pin level inversion */
} linflexd_uart_txrx_invert_enum;

/* LINFlexD_UART IPS bus size type */
typedef enum{
    LINFLEXD_UART_IPS_DATA_WORD = 0U,       /*!< Word size (32-bit) data transmitted on IPS bus */
    LINFLEXD_UART_IPS_DATA_BYTE = 1U,       /*!< Byte size (8-bit) data transmitted on IPS bus */
    LINFLEXD_UART_IPS_DATA_HALFWORD = 2U    /*!< Half-word size (16-bit) data transmitted on IPS bus */
} linflexd_uart_ips_sizetype_enum;

/* LINFlexD_UART parameter structure */
typedef struct {
    uint32_t                            baudrate;      /*!< baud rate */
    ControlStatus                       parityenable;  /*!< parity control - ENABLE/DISABLE */
    linflexd_uart_parity_type_enum      paritytype;    /*!< always 0/always 1/even/odd */
    linflexd_uart_stop_bits_count_enum  stopbitscount; /*!< number of stop bits */
    linflexd_uart_word_length_enum      wordlength;    /*!< number of bits per transmitted/received word */
    linflexd_uart_txrx_mode_enum        txmodetype;    /*!< type of UART tx transfer (buffer/fifo) */
    linflexd_uart_txrx_mode_enum        rxmodetype;    /*!< type of UART rx transfer (buffer/fifo) */
} linflexd_uart_parameter_struct;

/* configure LINFlexD_UART transmitter */
#define UARTCR_TXEN(regval)                   (BIT(4) & ((uint32_t)(regval) << 4))
#define LINFLEXD_UART_TRANSMIT_ENABLE         UARTCR_TXEN(1)                    /*!< enable transmitter */
#define LINFLEXD_UART_TRANSMIT_DISABLE        UARTCR_TXEN(0)                    /*!< disable transmitter */

/* configure LINFlexD_UART receiver */
#define UARTCR_RXEN(regval)                   (BIT(5) & ((uint32_t)(regval) << 5))
#define LINFLEXD_UART_RECEIVE_ENABLE          UARTCR_RXEN(1)                    /*!< enable receiver */
#define LINFLEXD_UART_RECEIVE_DISABLE         UARTCR_RXEN(0)                    /*!< disable receiver */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check LINFLEXD_UART peripherals */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) 
#define NOT_LINFLEXD_UART_PERIPH(periph)     (((periph) != LINFLEXD_UART0)  && ((periph) != LINFLEXD_UART1)  && \
                                              ((periph) != LINFLEXD_UART2)  && ((periph) != LINFLEXD_UART3)  && \
                                              ((periph) != LINFLEXD_UART4)  && ((periph) != LINFLEXD_UART5)  && \
                                              ((periph) != LINFLEXD_UART6)  && ((periph) != LINFLEXD_UART7)  && \
                                              ((periph) != LINFLEXD_UART8)  && ((periph) != LINFLEXD_UART9)  && \
                                              ((periph) != LINFLEXD_UART10) && ((periph) != LINFLEXD_UART11))
#else
#define NOT_LINFLEXD_UART_PERIPH(periph)     (((periph) != LINFLEXD_UART0)  && ((periph) != LINFLEXD_UART1)  && \
                                              ((periph) != LINFLEXD_UART2)  && ((periph) != LINFLEXD_UART3)  && \
                                              ((periph) != LINFLEXD_UART4)  && ((periph) != LINFLEXD_UART5))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* check if the baudrate is not a LINFlexD_UART baudrate */
#define NOT_LINFLEXD_UART_BAUDRATE(baudval)                  ((baudval) == 0U)

/* check integer baud rate parameter */
#define NOT_LINFLEXD_UART_IBR(ibr)                           ((ibr) > 0xFFFFFU)

