sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_uart.h
/* check fractional baud rate parameter */
#define NOT_LINFLEXD_UART_FBR(fbr)                           ((fbr) > 0xFU)

/* check LINFlexD_UART transmitter configuration */
#define NOT_LINFLEXD_UART_TRANSMITTER_CONFIG(mode)           (((mode) != LINFLEXD_UART_TRANSMIT_ENABLE) && \
                                                             ((mode) != LINFLEXD_UART_TRANSMIT_DISABLE))

/* check LINFlexD_UART receiver configuration */
#define NOT_LINFLEXD_UART_RECEIVER_CONFIG(mode)              (((mode) != LINFLEXD_UART_RECEIVE_ENABLE) && \
                                                             ((mode) != LINFLEXD_UART_RECEIVE_DISABLE))

/* check LINFlexD_UART receiver configuration */
#define NOT_LINFLEXD_UART_RXTX_FIELDLENGTH(length)           (((length) != 0x0U) && ((length) != 0x1U) && \
                                                             ((length) != 0x2U) && ((length) != 0x3U) && \
                                                             ((length) != 0x4U))

/* check timeout value parameter */
#define NOT_LINFLEXD_UART_TIMEOUT_VALUE(value)               ((value) > 0xFFFU)

/* check frame count parameter */
#define NOT_LINFLEXD_UART_EXPECTED_FRAME_COUNT(length)       ((length) > 0x7U)

/* check oversampling rate parameter (valid values are 4, 5, 6, 8) */
#define NOT_LINFLEXD_UART_OSRCOUNT(count)                    ((count) != 0x4U && (count) != 0x5U && \
                                                             (count) != 0x6U && (count) != 0x8U)

/* check configurable sample point (valid values are 2, 3, 4, 5) */
#define NOT_LINFLEXD_UART_CSPCOUNT(count)                    ((count) != 0x2U && (count) != 0x3U && \
                                                             (count) != 0x4U && (count) != 0x5U)

#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* initialization and configuration functions */
/* reset LINFlexD_UART */
ErrStatus linflexd_uart_deinit(uint32_t linflexd_uart_periph);
/* initialize the parameters of LINFlexD_UART struct with default values */
void linflexd_uart_struct_para_init(linflexd_uart_parameter_struct *linflexd_uart_struct);
/* initialize LINFlexD_UART parameter */
ErrStatus linflexd_uart_init(uint32_t linflexd_uart_periph, linflexd_uart_parameter_struct *linflexd_uart_struct);
/* LINFlexD_UART enter init mode */
void linflexd_uart_initmode_enter(uint32_t linflexd_uart_periph);
/* LINFlexD_UART enter normal mode */
void linflexd_uart_normalmode_enter(uint32_t linflexd_uart_periph);
/* LINFlexD_UART soft reset */
void linflexd_uart_soft_reset(uint32_t linflexd_uart_periph);

/* mode and state control functions */
/* enable LINFlexD_UART sleep mode */
void linflexd_uart_sleepmode_enable(uint32_t linflexd_uart_periph);
/* disable LINFlexD_UART sleep mode */
void linflexd_uart_sleepmode_disable(uint32_t linflexd_uart_periph);
/* get LINFlexD_UART sleep mode */
FlagStatus linflexd_uart_sleepmode_get(uint32_t linflexd_uart_periph);
/* enable LINFlexD_UART receiver buffer locked mode */
void linflexd_uart_receiverbufferlocked_enable(uint32_t linflexd_uart_periph);
/* disable LINFlexD_UART receiver buffer locked mode */
void linflexd_uart_receiverbufferlocked_disable(uint32_t linflexd_uart_periph);
/* enable LINFlexD_UART loopback mode */
void linflexd_uart_loopback_enable(uint32_t linflexd_uart_periph);
/* disable LINFlexD_UART loopback mode */
void linflexd_uart_loopback_disable(uint32_t linflexd_uart_periph);
/* config LINFlexD_UART auto wakeup hardware to clear the SLEEP bit */
void linflexd_uart_autowake_hw_clear(uint32_t linflexd_uart_periph);
/* config LINFlexD_UART auto wakeup software to clear the SLEEP bit */
void linflexd_uart_autowake_sw_clear(uint32_t linflexd_uart_periph);
/* LINFlexD_UART mode (LIN/UART) set */
void linflexd_uart_mode_set(uint32_t linflexd_uart_periph, linflexd_uart_mode_enum mode);
/* LINFlexD_UART current state get */
linflexd_uart_state_enum linflexd_uart_state_get(uint32_t linflexd_uart_periph);
/* LINFlexD_UART abort the current transmission */
void linflexd_uart_abort_request(uint32_t linflexd_uart_periph);
/* LINFlexD_UART terminate the transmission */
void linflexd_uart_terminate_transmit(uint32_t linflexd_uart_periph, ControlStatus mode);
/* LINFlexD_UART stop state get */
FlagStatus linflexd_uart_stop_get(uint32_t linflexd_uart_periph);

/* parameter setting functions */
/* LINFlexD_UART integer baudrate set */
void linflexd_uart_integer_baudrate_set(uint32_t linflexd_uart_periph, uint32_t ibr);
/* LINFlexD_UART fractional baudrate set */
void linflexd_uart_fractional_baudrate_set(uint32_t linflexd_uart_periph, uint8_t fbr);
/* configure LINFlexD_UART baudrate value */
ErrStatus linflexd_uart_baudrate_set(uint32_t linflexd_uart_periph, uint32_t baudval);
/* LINFlexD_UART word length set */
void linflexd_uart_wordlength_set(uint32_t linflexd_uart_periph, linflexd_uart_word_length_enum length);
/* get LINFlexD_UART word length */
linflexd_uart_word_length_enum linflexd_uart_wordlength_get(uint32_t linflexd_uart_periph);
/* enable LINFlexD_UART parity bit */
void linflexd_uart_paritycontrol_enable(uint32_t linflexd_uart_periph);
/* disable LINFlexD_UART parity bit */
void linflexd_uart_paritycontrol_disable(uint32_t linflexd_uart_periph);
/* LINFlexD_UART parity type set */
void linflexd_uart_paritytype_set(uint32_t linflexd_uart_periph, linflexd_uart_parity_type_enum paritytype);
/* set LINFlexD_UART receiver data field length */
void linflexd_uart_rxdatafieldlength_set(uint32_t linflexd_uart_periph, uint8_t length);
/* set LINFlexD_UART transmitter data field length */
void linflexd_uart_txdatafieldlength_set(uint32_t linflexd_uart_periph, uint8_t length);
/* set LINFlexD_UART number of stop bits for Rx */
void linflexd_uart_rxstopbitscount_set(uint32_t linflexd_uart_periph, linflexd_uart_stop_bits_count_enum stopbitscount);
/* set LINFlexD_UART number of stop bits for Tx */
void linflexd_uart_txstopbitscount_set(uint32_t linflexd_uart_periph, linflexd_uart_stop_bits_count_enum stopbitscount);
/* LINFlexD_UART monitors the idle state of the reception line */
void linflexd_uart_idle_receive_line_monitor(uint32_t linflexd_uart_periph);
/* LINFlexD_UART monitors the number of bits to be received */
void linflexd_uart_number_receive_bits_monitor(uint32_t linflexd_uart_periph);
/* set LINFlexD_UART reset mode of the timeout counter */
void linflexd_uart_timeout_resetmode_set(uint32_t linflexd_uart_periph, linflexd_uart_timeout_control_enum mode);
/* set LINFlexD_UART value of the timeout counter */
void linflexd_uart_idle_timeoutvalue_set(uint32_t linflexd_uart_periph, uint32_t value);
/* enable LINFlexD_UART special word length mode */
void linflexd_uart_specialwordlength_enable(uint32_t linflexd_uart_periph);
/* disable LINFlexD_UART special word length mode */
void linflexd_uart_specialwordlength_disable(uint32_t linflexd_uart_periph);
/* set LINFlexD_UART number of expected frame */
void linflexd_uart_expect_framenumber_set(uint32_t linflexd_uart_periph, uint8_t framecount);
/* config LINFlexD_UART transmit data first bit MSB */
void linflexd_uart_transmit_datafirst_config(uint32_t linflexd_uart_periph, linflexd_uart_datafirst_enum mode);
/* config LINFlexD_UART received data first bit MSB */
void linflexd_uart_receive_datafirst_config(uint32_t linflexd_uart_periph, linflexd_uart_datafirst_enum mode);
/* config LINFlexD_UART transmit invert */
void linflexd_uart_transmitdata_invert_config(uint32_t linflexd_uart_periph, linflexd_uart_txrx_invert_enum mode);
/* config LINFlexD_UART receive invert */
void linflexd_uart_receivedata_invert_config(uint32_t linflexd_uart_periph, linflexd_uart_txrx_invert_enum mode);
/* config LINFlexD_UART transmit invert */
void linflexd_uart_transmitpin_invert_config(uint32_t linflexd_uart_periph, linflexd_uart_txrx_invert_enum mode);
/* config LINFlexD_UART receive invert */
void linflexd_uart_receivepin_invert_config(uint32_t linflexd_uart_periph, linflexd_uart_txrx_invert_enum mode);
/* set LINFlexD_UART byte size for transmission on the IPS bus */
void linflexd_uart_ips_size_set(uint32_t linflexd_uart_periph, linflexd_uart_ips_sizetype_enum size);

/* transmit and receive functions */
/* configure LINFlexD_UART transmitter */
void linflexd_uart_transmitter_config(uint32_t linflexd_uart_periph, uint32_t txconfig);
/* configure LINFlexD_UART receiver */
void linflexd_uart_receiver_config(uint32_t linflexd_uart_periph, uint32_t rxconfig);
/* set LINFlexD_UART transmitter mode (FIFO/Buffer) */
void linflexd_uart_txmode_set(uint32_t linflexd_uart_periph, linflexd_uart_txrx_mode_enum mode);
/* set LINFlexD_UART receiver mode (FIFO/Buffer) */
void linflexd_uart_rxmode_set(uint32_t linflexd_uart_periph, linflexd_uart_txrx_mode_enum mode);
/* flush the data register of LINFlexD_UART receive buffer */
void linflexd_uart_rxfifo_flush(uint32_t linflexd_uart_periph);
/* LINFlexD_UART transmit the tx data by byte */
void linflexd_uart_byte_transmit(uint32_t linflexd_uart_periph, uint8_t data);
/* LINFlexD_UART transmit the tx data by halfword */
void linflexd_uart_halfword_transmit(uint32_t linflexd_uart_periph, uint16_t data);
/* LINFlexD_UART receive the rx data by byte */
uint8_t linflexd_uart_byte_receive(uint32_t linflexd_uart_periph);
/* LINFlexD_UART receive the rx data by halfword */
uint16_t linflexd_uart_halfword_receive(uint32_t linflexd_uart_periph);
/* enable LINFlexD_UART tx dma channel */
void linflexd_uart_tx_dma_enable(uint32_t linflexd_uart_periph);
/* disable LINFlexD_UART tx dma channel */
void linflexd_uart_tx_dma_disable(uint32_t linflexd_uart_periph);
/* enable LINFlexD_UART rx dma channel */
void linflexd_uart_rx_dma_enable(uint32_t linflexd_uart_periph);
/* disable LINFlexD_UART rx dma channel */
void linflexd_uart_rx_dma_disable(uint32_t linflexd_uart_periph);

/* higher speed baudrate functions */
/* enable LINFlexD_UART reduced oversampling */
void linflexd_uart_reducedoversampling_enable(uint32_t linflexd_uart_periph);
/* disable LINFlexD_UART reduced oversampling */
void linflexd_uart_reducedoversampling_disable(uint32_t linflexd_uart_periph);
/* set LINFlexD_UART over sampling rate */
void linflexd_uart_oversamplingrate_set(uint32_t linflexd_uart_periph, uint8_t osrcount);
/* set LINFlexD_UART configurable sample points */
void linflexd_uart_samplepoint_set(uint32_t linflexd_uart_periph, uint8_t cspcount);

/* interrupt and flag functions */
/* return LINFlexD_UART flag */
FlagStatus linflexd_uart_flag_get(uint32_t linflexd_uart_periph, linflexd_uart_flag_enum flag);
/* clear LINFlexD_UART interrupt flag */
void linflexd_uart_flag_clear(uint32_t linflexd_uart_periph, linflexd_uart_flag_enum flag);
/* enable LINFlexD_UART interrupt */
void linflexd_uart_interrupt_enable(uint32_t linflexd_uart_periph, linflexd_uart_interrupt_enum interrupt);
/* disable LINFlexD_UART interrupt */
void linflexd_uart_interrupt_disable(uint32_t linflexd_uart_periph, linflexd_uart_interrupt_enum interrupt);
/* get LINFlexD_UART interrupt flag */
FlagStatus linflexd_uart_interrupt_flag_get(uint32_t linflexd_uart_periph, linflexd_uart_interrupt_flag_enum int_flag);
/* clear LINFlexD_UART interrupt flag */
void linflexd_uart_interrupt_flag_clear(uint32_t linflexd_uart_periph, linflexd_uart_interrupt_flag_enum int_flag);

#endif /* GD32A7XX_LINFLEXD_UART_H */
